app/Helpers/custom_helper.php

SELECT *
FROM `users`
WHERE `id` = '29'
 LIMIT 1
---
function get_user_name($id) {

   $model=new UserModel();
   $row=$model->where('id',$id)->first();

SELECT *
FROM `users`
WHERE `id` = '29'
 LIMIT 1
---
function get_user_email($id) {

   $model=new UserModel();
   $row=$model->where('id',$id)->first();

SELECT * FROM `user_group` where user_id = 29
---
function gettingmenuzero()
{
	$userData = session()->get();

	$db    = \Config\Database::connect();
	$role  = "SELECT * FROM `user_group` where user_id = ".$userData['user_id']."";
	$query = $db->query($role);
	$role  = $query->getRow();


	if(!isset($role)){

		$add_user_group="INSERT INTO `user_group` SET user_id = ".$userData['user_id'].",group_id = 2 ";
		$query = $db->query($add_user_group);

		$Frole = 2;

	}else{

		$Frole=$role->group_id;

SELECT * FROM `user_group` WHERE user_id = 294
---
function gettingchild($parentid)
{
    $db = \Config\Database::connect();
    $userData = session()->get();
    $role = "SELECT * FROM `user_group` WHERE user_id = " . $userData['user_id'] . "";
    $query = $db->query($role);
    $role = $query->getRow();
    $Frole = $role->group_id;

SELECT * FROM `user_group` WHERE user_id = 29
---
function gettingchildnew($parentid)
{
    $db = \Config\Database::connect();
    $userData = session()->get();
    $role = "SELECT * FROM `user_group` WHERE user_id = " . $userData['user_id'] . "";
    $query = $db->query($role);
    $role = $query->getRow();
    $Frole = $role->group_id;