app/Filters/ChurchFilter.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `id` = '29'
AND `user_plan` = 0
AND `parent` = 0
---

            $UserModel = new UserModel();

            $count = $UserModel
            ->where('id', session()->user_id)
            ->where('user_plan =', 0)
            ->where('parent =', 0)