app/Views/include/topheader.php

                <?php
               $db = db_connect();
               $user_id = session()->get('user_id');
               $query = $db->table('tbl_task_alert')
                           ->where('user', $user_id)
                           ->where('is_read','N')
                           ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_task_alert`
WHERE `user` = 294
AND `is_read` = 'N'