app/Controllers/Churches.php

SELECT *
FROM `users`
WHERE `id` = 298
 LIMIT 1
---
    public function viewchurch()
{
    $userid = session()->user_id;
    $UserModel= new UserModel();
    $user =  $UserModel->where('id',$userid)->first();