app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `email` = 'churchadmin@congreg8.org'
 LIMIT 1
---
    public function index()

    {
        $config         = new \Config\Encryption();
        $encrypter = \Config\Services::encrypter($config);

        if(isset($_REQUEST['login'])){
            $check=$this->request->getVar('remember_me');
            $email=$this->request->getVar('email');
            $password=$this->request->getVar('password');

            $session = session();

            $UserModel=new UserModel();
            $UserChurchModel = new UserChurchModel();

            $email = $this->request->getVar('email');
            $password = $this->request->getVar('password');
            $user = $UserModel->where('email', $email)->first();