app/Controllers/Payment.php

    public function bill(){


        $planTitle = session()->get('Plan_title');
        $amount = session()->get('amount');
        $intervalType = session()->get('intervaltype');
        $intervalCount = session()->get('interval_count');
        $txrId = session()->get('txrid');
        $session = session();
        $userid = session()->user_id;

        $UserModel= new UserModel();
        $data12["Plan_title"] = $planTitle;
        $data12["amount"] = $amount ;
        $data12["intervaltype"] = $intervalType;
        $data12["interval_count"] =$intervalCount;
        $data12["txrid"] = $txrId ;
        $data12["user"] =  $UserModel->where('id',$userid)->first();
---
SELECT *
FROM `users`
WHERE `id` = 279
 LIMIT 1


        $UserModel = new UserModel();
       // $sub_user = $UserModel->where("church_id",  session()->user_church_id)->where('parent',session()->user_id)->get()->getResult();
        $sub_user = $UserModel->where("church_id",  session()->user_church_id)->where("id",'!',session()->user_id)->get()->getResult();
        $admin = $UserModel->where("id", session()->user_id)->get()->getResult();
---
SELECT *
FROM `users`
WHERE `church_id` = 232
AND `id` = '!'
SELECT *
FROM `users`
WHERE `id` = 287

            $planPrice = $plan["pm_price"]*$sub_user_count;
            $interval = "month";
        }
        $emailData = $UserModel->where("id", $userid)->first();
---
SELECT *
FROM `users`
WHERE `id` = 287
 LIMIT 1

                "user_plan" => $planid,
            ];

            $UserModel->update($userid, $userData);

            $user = $UserModel->find($userid);
---
UPDATE `users` SET `stripe_key_id` = 'cus_RHBXxkdpDUfCB3', `user_plan` = '2'
WHERE `users`.`id` IN (287)
SELECT *
FROM `users`
WHERE `users`.`id` = 287

            ];

            // Insert data into the 'subscription' table
            $subscription->insert($data);
---
INSERT INTO `Plan_Subscription` (`user_id`, `church_id`, `plan_id`, `plan_start`, `plan_end`, `plan_type`, `plan_amount`, `plan_status`, `plan_rstatus`) VALUES (287, '232', '2', '2024-11-24 10:35:22', '2024-12-08 10:35:22', 'trial', 11, 'Y', 'Y')

                ];


                $billing->insert($data);
---
INSERT INTO `billing` (`bl_user`, `bl_parent`, `bl_church`) VALUES ('287', 0, 232)