app/Controllers/ProfileController.php

SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1
---
        function EditView()

        {
            $config         = new \Config\Encryption();
            $encrypter = \Config\Services::encrypter($config);

            $UserModel= new UserModel();

           $userData = session()->get();

           $userid= $userData['user_id'];

           $user = $UserModel->where('id=',$userid)->first();