app/Controllers/Signup.php

SELECT *
FROM `users`
WHERE `id` = 280
AND `otp` = '1111'
 LIMIT 1
SELECT *
FROM `users`
WHERE `id` = 284
 LIMIT 1
---
	public function verifyotp()
	{

		$session = session();
        $userid = session()->user_id;

		$db      = \Config\Database::connect();
		$UserModel= new UserModel();
		$otp = $this->request->getPost('otp');
		$user = $UserModel->where('id',$userid)->where('otp',$otp)->first();

		if (empty($user)) {

			$data = [
				'error' => true,
				'message' => 'OTP is not matched!'
			];
			return  json_encode($data);
		}

		$ChurchModel=new ChurchModel;
		$church = $ChurchModel->where('parentid =',$userid)->first();