app/Controllers/Signup.php

	public function verifyotp()
	{
		$session = session();
        $userid = session()->user_id;

		$db      = \Config\Database::connect();
		$UserModel= new UserModel();
		$otp = $this->request->getPost('otp');
		$user = $UserModel->where('id',$userid)->where('otp',$otp)->first();
---
SELECT *
FROM `users`
WHERE `id` = 287
AND `otp` = '7328'
 LIMIT 1