app/Controllers/UserController.php

SELECT *
FROM `users`
WHERE `parent` = 294
AND `rstatus` = 'Y'
---
    function UserData()
    {
       $UserModel = new UserModel();

       $urole = get_user_role(session()->user_id);


        if($urole=='superadmin')

        {

            $user = $UserModel->where('rstatus','Y')->findAll();

            $data = [
                'users'=>$user,
                'title'=>"Dashboard||Admin panel"
            ];

        }

      else

        {

            $user = $UserModel->where('parent =',session()->user_id)->where('rstatus','Y')->findAll();